; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	infrared3 - mode
	thermograph2 - mode
	spectrograph4 - mode
	image5 - mode
	image1 - mode
	thermograph0 - mode
	Star6 - direction
	Star5 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Star0 - direction
	Star4 - direction
	Star3 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image5)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument1 image1)
	(calibration_target instrument1 Star5)
	(supports instrument2 image5)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star4)
	(supports instrument3 spectrograph4)
	(supports instrument3 thermograph2)
	(supports instrument3 image5)
	(calibration_target instrument3 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
	(supports instrument4 image5)
	(supports instrument4 image1)
	(calibration_target instrument4 Star0)
	(supports instrument5 spectrograph4)
	(supports instrument5 infrared3)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 image1)
	(supports instrument6 infrared3)
	(calibration_target instrument6 GroundStation1)
	(calibration_target instrument6 Star0)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
	(supports instrument7 image1)
	(supports instrument7 image5)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 Star4)
	(calibration_target instrument7 Star0)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star5)
	(supports instrument8 thermograph0)
	(supports instrument8 image1)
	(calibration_target instrument8 Star3)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star7)
)
(:goal (and
	(pointing satellite1 Planet11)
	(pointing satellite3 Planet8)
	(pointing satellite4 Star3)
	(have_image Star7 image1)
	(have_image Star7 infrared3)
	(have_image Planet8 image1)
	(have_image Planet8 spectrograph4)
	(have_image Star9 infrared3)
	(have_image Star9 image1)
	(have_image Planet10 thermograph2)
	(have_image Planet11 image5)
))

)

; plan
1. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 11
2. (calibrate satellite2 instrument6 star0)
   added: (calibrated instrument6)
   goals met: 0 of 11
3. (turn_to satellite2 star9 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star9)
   goals met: 0 of 11
4. (take_image satellite2 star9 instrument6 infrared3)
   added: (have_image star9 infrared3)
   goals met: 1 of 11
5. (take_image satellite2 star9 instrument6 image1)
   added: (have_image star9 image1)
   goals met: 2 of 11
6. (turn_to satellite2 star7 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 star7)
   goals met: 2 of 11
7. (take_image satellite2 star7 instrument6 infrared3)
   added: (have_image star7 infrared3)
   goals met: 3 of 11
8. (take_image satellite2 star7 instrument6 image1)
   added: (have_image star7 image1)
   goals met: 4 of 11
9. (turn_to satellite2 planet8 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 planet8)
   goals met: 4 of 11
10. (turn_to satellite1 star0 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star0)
   goals met: 4 of 11
11. (take_image satellite2 planet8 instrument6 image1)
   added: (have_image planet8 image1)
   goals met: 5 of 11
12. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 5 of 11
13. (calibrate satellite1 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 5 of 11
14. (turn_to satellite1 planet10 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet10)
   goals met: 5 of 11
15. (take_image satellite1 planet10 instrument3 thermograph2)
   added: (have_image planet10 thermograph2)
   goals met: 6 of 11
16. (turn_to satellite1 planet8 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet8)
   goals met: 6 of 11
17. (take_image satellite1 planet8 instrument3 spectrograph4)
   added: (have_image planet8 spectrograph4)
   goals met: 7 of 11
18. (turn_to satellite1 planet11 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet11)
   goals met: 8 of 11
19. (take_image satellite1 planet11 instrument3 image5)
   added: (have_image planet11 image5)
   goals met: 9 of 11
20. (turn_to satellite3 planet8 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 planet8)
   goals met: 10 of 11
21. (turn_to satellite4 star3 star7)
   deleted: (pointing satellite4 star7)
   added: (pointing satellite4 star3)
   goals met: 11 of 11
